# Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/keuperj/DataScienceSS20.git
  path='DataScienceSS20'

running in Colab: True
Cloning into 'DataScienceSS20'...
remote: Enumerating objects: 550, done.
remote: Total 550 (delta 0), reused 0 (delta 0), pack-reused 550
Receiving objects: 100% (550/550), 122.05 MiB | 23.03 MiB/s, done.
Resolving deltas: 100% (221/221), done.
Checking out files: 100% (210/210), done.

In [0]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"``.

### Step 3. Assign it to a variable called baby_names.

In [0]:
baby_names = pd.read_csv(path+"/DATA/US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
del baby_names['Unnamed: 0']
del baby_names['Id']
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [8]:
baby_names.Gender.value_counts().idxmax()

'F'

### Step 7. Group the dataset by name and assign to names

In [0]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [40]:
names.size()

Name
Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Length: 17632, dtype: int64

### Step 9. What is the name with most occurrences?

In [82]:
names.size().idxmax()

'Riley'

### Step 10. How many different names have the least occurrences?

In [109]:
summedNames = names.sum()
len(summedNames[summedNames.Count == summedNames.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [110]:
len(summedNames[summedNames.Count == summedNames.Count.median()])

66

### Step 12. What is the standard deviation of names?

In [105]:
names.sum().Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [111]:
names.describe()

          Year                                 ... Count
         count         mean       std     min  ...   25%   50%    75%    max
Name                                           ...
Aaban      2.0  2013.500000  0.707107  2013.0  ...  6.00   6.0   6.00    6.0
Aadan      4.0  2009.750000  2.872281  2008.0  ...  5.00   5.5   6.25    7.0
Aadarsh    1.0  2009.000000       NaN  2009.0  ...  5.00   5.0   5.00    5.0
Aaden    196.0  2010.015306  2.044322  2005.0  ...  6.00  10.0  20.00  158.0
Aadhav     1.0  2014.000000       NaN  2014.0  ...  6.00   6.0   6.00    6.0
...        ...          ...       ...     ...  ...   ...   ...    ...    ...
Zyra       7.0  2012.142857  2.115701  2008.0  ...  5.00   6.0   6.50    8.0
Zyrah      2.0  2012.000000  1.414214  2011.0  ...  5.25   5.5   5.75    6.0
Zyren      1.0  2013.000000       NaN  2013.0  ...  6.00   6.0   6.00    6.0
Zyria     10.0  2008.900000  2.685351  2005.0  ...  5.25   6.0   6.00    7.0
Zyriah     9.0  2009.666667  2.915476  2006.0  ...  5.00   6.0   7.00   10.0

[17632 rows x 16 columns]